---
kind: type
id: T:Autodesk.Revit.DB.ConicalFace
source: html/62813f17-d82f-7898-d3d9-9656392eadd6.htm
---
# Autodesk.Revit.DB.ConicalFace

A conical face of a 3d solid or open shell.

## Syntax (C#)
```csharp
public class ConicalFace : Face
```

## Remarks
For details on the parameterization, refer to the documentation for ConicalSurface .